#!/usr/bin/env python
# -*- coding: utf-8 -*-

# @Time    : 2020/7/9 下午2:10
# @Author  : Hanley
# @File    : status.py
# @Desc    : 

CODE_0 = 0  # "错误返回"
CODE_1 = 1  # "成功返回"
CODE_2 = 2  # "有车系ID"
CODE_100 = 100  # 外部接口成功返回
CODE_200 = 200
CODE_201 = 201  # "手机号格式错误"
CODE_202 = 202  # "该手机号已注册"
CODE_203 = 203  # "账户不存在，请先注册"
CODE_204 = 204  # "登陆密码错误，请输入正确密码"
CODE_205 = 205  # "请先登录"
CODE_206 = 206  # "请输入账号密码"
CODE_207 = 207  # "请完善个人信息"
CODE_208 = 208  # "两次输入密码不一致，请重新输入"
CODE_209 = 209  # "新密码与旧密码相同，请重新输入"
CODE_210 = 210  # "该账户异常"
CODE_401 = 401  # "验证码已失效"
CODE_402 = 402  # "验证码不正确"
CODE_403 = 403  # "权限不正确"
CODE_404 = 404  # "未知路径"
CODE_405 = 405  # "无法识别设备"
CODE_406 = 406  # "无法识别该操作"
CODE_407 = 407  # "该数据不存在"
CODE_408 = 408  # "未知渠道用户"
CODE_409 = 409  # 参数取值越界，请确认后再试
CODE_410 = 410  # 未设置收货地址
CODE_411 = 411  # 该车架号数据正在准备中，换个车架号试试吧
CODE_500 = 500  # "程序错误，请联系相关人员"
CODE_501 = 501  # "kz接口数据解析异常"
CODE_502 = 502  # "station接口数据解析异常"
CODE_503 = 503  # 外部接口调用异常
CODE_504 = 504  # epc接口返回异常
CODE_505 = 505  # 单据已过期
CODE_506 = 506  # IM接口返回异常
CODE_507 = 507  # 资金服务返回异常
CODE_600 = 600  # "传入参数错误"
CODE_601 = 601  # "销售车型查询异常"
